Revit 2027 API
ParameterTypeId.StructuralAnalyzesAs Property
 "Analyze As"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StructuralAnalyzesAs { get; }
Public Shared ReadOnly Property StructuralAnalyzesAs As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StructuralAnalyzesAs {
	ForgeTypeId^ get ();
}
static member StructuralAnalyzesAs : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace